public class lesson3 {
    public static void main(String[] args) {
/*      Задание
        Используя IntelliJ IDEA, создайте проект c классом main.
        Создайте две целочисленные переменные и выведите на экран результаты всех арифметических
        операций над этими двумя переменными.
*/
        short a = 2, b = 11;
        double ab;

        ab = (a/b);

        System.out.println("a+b: "+ (a+b));
        System.out.println("a-b: "+ (a-b));
        System.out.println("a*b: "+ (a*b));
        System.out.println("a/b: "+ ab);
//        System.out.println(a+b);

/*      Задание 1
        Имеется 3 переменные типа int x = 10, y = 12, и z = 3;
        Выполните и рассчитайте результат следующих операций для этих переменных:
*/


    }
}
